## VLAN Configuration

```
DS2(config)#vlan 100
DS2(config-vlan)#name FINANCE
DS2(config-vlan)#vlan 101
DS2(config-vlan)#name ACCOUNT
DS2(config-vlan)#vlan 102
DS2(config-vlan)#name PLANNING
DS2(config-vlan)#vlan 103
DS2(config-vlan)#name TREASURE
DS2(config-vlan)#vlan 999
DS2(config-vlan)#EXit
```

---

## RSTP Configuration

```
DS2(config)#spanning-tree mode rapid-pvst
DS2(config)#spanning-tree vlan 100-103 root primary
DS2(config)#interface range ethernet 0/1-2
DS2(config-if-range)#spanning-tree guard root
```

---

## Etherchannel Configuration

```
DS2(config)#interface range e0/1-2
DS2(config-if-range)#description DS2_TO_AS2
DS2(config-if-range)#shutdown
DS2(config-if-range)#channel-group 1 mode desirable
DS2(config-if-range)#switchport trunk encapsulation dot1q
DS2(config-if-range)#switchport mode trunk
DS2(config-if-range)#switchport trunk allowed vlan 100-103
DS2(config-if-range)#switchport trunk native vlan 999
DS2(config-if-range)#ex
```

---

## Inter-VLAN Routing Configuration

```
DS2(config)#ip routing
DS2(config)#interface vlan 100
DS2(config-if)#ip address 10.0.4.1 255.255.255.0
DS2(config-if)#ex
DS2(config)#interface vlan 101
DS2(config-if)#ip address 10.0.5.1 255.255.255.0
DS2(config-if)#ex
DS2(config)#interface vlan 102
DS2(config-if)#ip add 10.0.6.1 255.255.255.0
DS2(config-if)#ex
DS2(config)#interface vlan 103
DS2(config-if)#ip address 10.0.7.1 255.255.255.0
DS2(config-if)#ex
```
