## VTP & VLAN Configuration

```
Switch>en
Switch#conf t
Switch(config)#hostname DS3
DS3(config)#vtp domain CCNP.
DS3(config)#vtp version 3
DS3(config)#vtp password CCNPENCOR
DS3(config)#exit
DS3#vtp primary
DS3#conf t
DS3(config)#vlan 1007
DS3(config-vlan)#name QC
DS3(config-vlan)#vlan 1008
DS3(config-vlan)#name WAREHOUSE
DS3(config-vlan)#vlan 1009
DS3(config-vlan)#name CUSTOMER_SERVICE
DS3(config-vlan)#vlan 1010
DS3(config-vlan)#name ADMIN
DS3(config-vlan)#vlan 999
DS3(config-vlan)#exit
```

---

## MST Configuration

```
DS3(config)#vtp mode server mst
DS3(config)#exit
DS3#vtp primary mst
DS3#conf t
DS3(config)#spanning-tree mode mst
DS3(config)#spanning-tree mst configuration
DS3(config-mst)#name CCNP
DS3(config-mst)#instance 1 vlan 1007-1008
DS3(config-mst)#instance 2 vlan 1009-1010
DS3(config-mst)#exit
DS3(config)#spanning-tree mst 1-2 priority 0
DS3(config)#interface range ethernet 0/1-2
DS3(config-if-range)#spanning-tree guard root
DS3(config-if-range)#
```

---

## Etherchannel Configuration

```
DS3(config)#interface range ethernet 0/1-2
DS3(config-if-range)#description DS3_TO_AS3
DS3(config-if-range)#shutdown
DS3(config-if-range)#channel-group 1 mode on
DS3(config-if-range)#switchport trunk encapsulation dot1q
DS3(config-if-range)#switchport mode trunk
DS3(config-if-range)#switchport trunk allowed vlan 1007-1010
DS3(config-if-range)#switchport trunk native vlan 999
DS3(config-if-range)#ex
DS3(config)#vlan dot1q tag native
```

---

## Root Guard
```
DS3(config)#int po1
DS3(config-if)#spanning-tree guard root
```

---

## Inter-VLAN Routing

```
DS3(config)#ip routing
DS3(config)#interface vlan 1007
DS3(config-if)#ip add 10.0.8.1 255.255.255.0
DS3(config-if)#ex
DS3(config)#int vlan 1008
DS3(config-if)#ip add 10.0.9.1 255.255.255.0
DS3(config-if)#ex
DS3(config)#int vlan 1009
DS3(config-if)#ip add 10.0.10.1 255.255.255.0
DS3(config-if)#ex
DS3(config)#int vlan 1010
DS3(config-if)#ip add 10.0.11.1 255.255.255.0
DS3(config-if)#ex
DS3(config)#interface e0/0
DS3(config-if)#description DS3_TO_CS
DS3(config-if)#no switchport
DS3(config-if)#ip add 10.0.255.22 255.255.255.252

```

