
```
CS(config)#router ospf 10
CS(config-router)#router-id 10.10.10.10
CS(config-router)#ex
CS(config)#interface range e1/0,e1/2
CS(config-if-range)#ip ospf 10 area 0
CS(config-if-range)#ip ospf network point-to-point
CS(config-if-range)#ex
CS(config)#int e0/0
CS(config-if)#ip ospf 10 area 1
CS(config-if)#ip ospf network point-to-point
CS(config-if)#ex
CS(config)#int e0/1
CS(config-if)#ip ospf 10 area 2
CS(config-if)#ip ospf network point-to-point
CS(config-if)#ex
CS(config)#int e0/2
CS(config-if)#ip ospf 10 area 3
CS(config-if)#ip ospf network point-to-point
CS(config-if)#ex
CS(config)#interface e0/3
CS(config-if)#ip ospf 10 area 4
CS(config-if)#ip ospf network point-to-point
```

---

```
R1#conf t
R1(config)#router ospf 10
R1(config-router)#router-id 1.1.1.1
R1(config-router)#network 10.0.255.1 0.0.0.0 area 0
R1(config-router)#ex
R1(config)#int e0/1
R1(config-if)#ip ospf network point-to-point
R1(config-if)#ex
```

---

```
R2>en
R2#conf t
R2(config)#router ospf 10
R2(config-router)#router-id 2.2.2.2
R2(config-router)#network 10.0.255.5 0.0.0.0 area 0
R2(config-router)#ex
R2(config)#interface ethernet 0/0
R2(config-if)#ip ospf network point-to-point
R2(config-if)#ex
```

---

```
WAN-SW#conf t
WAN-SW(config)#router ospf 10
WAN-SW(config-router)#router-id 14.14.14.14
WAN-SW(config-router)#network 10.0.255.10 0.0.0.0 area 4
WAN-SW(config-router)#network 10.0.255.25 0.0.0.0 area 4
WAN-SW(config-router)#ex
WAN-SW(config)#interface range ethernet 0/0-1
WAN-SW(config-if-range)#ip ospf network point-to-po
WAN-SW(config-if-range)#ex
```

---

```
R7>en
R7#conf t
R7(config)#router ospf 10
R7(config-router)#router-id 7.7.7.7
R7(config-router)#network 10.0.255.26 0.0.0.0 area 4
R7(config-router)#ex
R7(config)#interface ethernet 0/0
R7(config-if)#ip ospf network point-to-point
R7(config-if)#ex
```

---

```
DS1#conf t
DS1(config)#router ospf 10
DS1(config-router)#router-id 11.11.11.11
DS1(config-router)#network 10.0.0.0 0.0.3.255 area 1
DS1(config-router)#network 10.0.255.14 0.0.0.0 area 1
DS1(config-router)#passive-interface default
DS1(config-router)#no passive-interface ethernet 0/0
DS1(config-router)#ex
DS1(config)#int
DS1(config)#interface e0/0
DS1(config-if)#ip ospf network point-to-point
```

---

```
DS2>en
DS2#conf t
DS2(config)#router ospf 10
DS2(config-router)#router-id 12.12.12.12
DS2(config-router)#network 10.0.4.0 0.0.3.255 area 2
DS2(config-router)#network 10.0.255.18 0.0.0.0 area 2
DS2(config-router)#passive-interface default
DS2(config-router)#no passive-interface ethernet 0/0
DS2(config-router)#ex
DS2(config)#interface ethernet 0/0
DS2(config-if)#ip ospf network point-to-point
DS2(config-if)#ex
```

---

```
DS3>en
DS3#conf t
DS3(config)#router ospf 10
DS3(config-router)#router-id 13.13.13.13
DS3(config-router)#network 10.0.8.0 0.0.3.255 area 3
DS3(config-router)#network 10.0.255.22 0.0.0.0 area 3
DS3(config-router)#passive-interface default
DS3(config-router)#no passive-interface ethernet 0/0
DS3(config-router)#ex
DS3(config)#interface e0/0
DS3(config-if)#ip ospf network point-to-point
DS3(config-if)#ex
```

---

## OSPF Authentication

```
CS#conf t
CS(config)#key chain OSPF_KEY
CS(config-keychain)#key 1
CS(config-keychain-key)#key-string CCNP_ENCOR_LAB
CS(config-keychain-key)#cryptographic-algorithm hmac-sha-512
CS(config-keychain-key)#ex
CS(config-keychain)#ex
CS(config)#int
CS(config)#interface e0/0
CS(config-if)#ip ospf authentication key-chain OSPF_KEY
CS(config-if)#ex
CS(config)#interface e1/0
CS(config-if)#ip ospf authentication message-digest
CS(config-if)#ip ospf message-digest-key 1 md5 CCNP_ENCOR_LAB
CS(config-if)#ex
CS(config)#
```

```
DS1>en
DS1#conf t
DS1(config)#key chain OSPF_KEY
DS1(config-keychain)#key 1
DS1(config-keychain-key)#key-string CCNP_ENCOR_LAB
DS1(config-keychain-key)#cryptographic-algorithm hmac-sha-512
DS1(config-keychain-key)#ex
DS1(config-keychain)#ex
DS1(config)#int e0/0
DS1(config-if)#ip ospf authentication key-chain OSPF_KEY
DS1(config-if)#ex
```
